trade_exp/src/Documents/ЛистСогласования/ЛистСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЛистСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="bd7ea247-d70a-4d92-8cd1-47dd38150946">
    <name>ЗадолженностьПоДоговору</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3512a52c-9acd-45aa-804a-ca5be089f33f">
    <name>ЗадолженностьПоПартнеру</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0bc5285-0919-4f85-a76a-917121dc97f7">
    <name>Проблема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89f1256b-558f-47e6-9ac4-50effd1ea3da">
    <name>ДатаИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e3352f3-d5d8-490e-bf93-180010c0e2bc">
    <name>Согласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2aa8b804-d300-40d4-8612-ffc4be650575">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4ea323fd-1fd1-401c-8754-d23f642bbee1">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e25d6271-38c5-420f-857c-1046650bddb2">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eb42b1f-fbbe-48cd-b72e-a17e84f5b3fd">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2969a8aa-a5b3-4ce7-81b3-c196f690ff12">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2664f229-27c5-4ab7-bdcc-6e1f12591738">
    <name>Исполнен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79deed0e-4a1e-4e98-abff-d97cca969ea3">
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cd483cea-3167-4be8-9a7b-907195fed864">
    <name>ОплатаДо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a82a6d7e-91c4-476b-846d-35797a773436">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c21d35e3-631d-41e4-97ad-6641158d01f1">
    <name>Согласователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64f86b4c-7d54-46b4-ac7a-f66b7c8a4ed3">
    <name>ДатаРегистрацииИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="61d8cf96-a87b-4b3f-82bd-f47b88a0a6b2">
    <name>ДатаРегистрацииСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9696be9-259d-48d2-acae-a488245743b7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7a11fe18-5ed9-4686-81a4-2c953068f858">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0e10f187-eed8-4a74-ad3f-41977c655684">
    <name>ОстатокДоступногоЛимита</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1a49d888-bd7f-4334-8ff8-e93a57cb570a">
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="526eac68-cb4b-4908-bc13-1a77e20acbf6">
    <name>Аннулирован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc47dd80-4fa8-4382-85cc-0bb2a6ea2344">
    <name>ДатаРегистрацииАннулирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eb1f6b46-b63a-41b8-be2a-95d8f14c5069">
    <name>ПользовательАннулировал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="061685f0-091a-457d-9c28-92025f6c5b4f">
    <name>СуммаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0bf38673-8ec2-4f32-8979-463fb5698aa6">
    <name>ДокументыСданы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0147949-9ac7-484e-a0ca-8b34f672cff8">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="164c893d-909d-49d8-a7ba-800c18b6d039">
    <name>ДатаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f4b22395-72bb-4776-b524-cfb53c57a4f4">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="550c31a7-7fbc-4734-a07f-2c1c7740b581">
    <name>АвторДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28ad8094-987b-4a04-be24-8dfc5c80007b">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="233e2c0e-f8f8-4b89-8226-26d79824c73b">
    <name>ТелефонВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9d617b0f-530e-468c-9892-04f5cb814fd8">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67a5e386-695b-4a2d-b797-85e8575cd0d9">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="adf90053-7b0e-4c0c-b68f-dea98e3d5512">
    <name>ЗакрывающийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b202c1c5-6f08-4c5a-a971-994b3a823381">
    <name>ПричинаАнулирования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f48d72a7-688f-4060-9471-78ce17ef6985">
    <name>ДокументыСданыКомментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="651738b7-f1d8-42b6-8715-ecf95d1cf2e6">
    <name>СогласованиеПросроченнойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1bc5b57-b12c-4d9d-8031-2f2f4a41c589">
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4441e03a-af91-4f94-b3af-ef3e1da779c9">
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="311a625c-24d8-4904-b476-ab8a851af32e">
    <name>ДатаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="af9eb79a-5875-48dd-a78f-f6b647d35e28">
    <name>СчетФактура</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="29b69425-b470-40ba-a4e7-ccf20f0881a0">
    <name>ОтправленоСогласователю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb028d7b-43a8-477f-9304-ad8ecc5530a4">
    <name>ДатаПередачиВБухгалтерию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1900bbe4-7fbe-47c9-9810-e3bd898afe33">
    <name>СтатусЛистаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ce52be8e-dbd2-4c4b-b7a7-611e5ca5521c">
    <name>ЕстьМаркированныйТовар</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a9084dcf-265d-4098-820d-eccd4153f5d6">
    <name>ОтправленоМенеджеру</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="07c7c64e-3afa-4b32-b3c3-4aca4478e4e0">
    <name>Проблемы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="78b64a6c-b2f2-484c-8326-b668f1343f0e">
      <name>ПроблемаРасшифровка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6bf3592f-8fd6-4297-970c-6377faa8eec4">
      <name>Выполнено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f315772c-11c4-4d38-86f9-344a698693fe">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ВидыОперацийЛистовСогласования/ВидыОперацийЛистовСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4e174d0c-fcf4-4edb-b771-d537842fb500">
  <name>ВидыОперацийЛистовСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0d0f242a-48ae-475d-ad76-05749bd4f77a">
    <name>СогласованиеТранзитов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="462fe71b-3cb9-4c1c-9888-bdb3e6556265">
    <name>СогласованиеЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="37f89f9f-becc-4e83-9791-d21c6238816b">
    <name>СогласованиеОформления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ФормыОплаты/ФормыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8cd09e10-4636-4941-882a-e1d11a583f37">
  <name>ФормыОплаты</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Наличная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Безналичная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Смешанная</name>
  </enumValues>
  <enumValues extendedConfigurationObject="551e55ef-70ce-48b5-bd48-20a0855bac13">
    <name>ПодарочныйСертификат</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="09285a09-9587-4f41-933d-ff6223c6983f">
    <name>БонусныеБаллы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЛистСогласования/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ОбновитьЗадолженностьСервер()
	Документы.ЛистСогласования.ОбновитьЗадолженностьСервер(Объект);
	
	//Объект.ЗадолженностьПоПартнеру= 0;
	//Объект.ЗадолженностьПоДоговору= 0;
	//Объект.ОстатокДоступногоЛимита= 0;
	//Объект.СуммаСогласования= 0;
	//ПорядокРасчетов= Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	//
	//Если ЗначениеЗаполнено(Объект.Основание.Договор) Тогда
	//	ПорядокРасчетов= Объект.Основание.Договор.ПорядокРасчетов;
	//КонецЕсли;
	//
	//Если Объект.ВидОперации <> Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления Тогда
	//	ДопустимаяСуммаЗадолженности= Объект.Основание.Договор.ДопустимаяСуммаЗадолженности;
	//	ДатаОстатковМоментВремени= Новый МоментВремени(Объект.Основание.Дата, Объект.Основание);
	//	
	//	ДатаОстатков= Новый Граница(ДатаОстатковМоментВремени, ВидГраницы.Включая);
	//	
	//	ЗадолженностьПоДоговору= ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоДоговору(ДатаОстатков, Объект.Основание.Договор);
	//	Объект.ЗадолженностьПоДоговору= ЗадолженностьПоДоговору- ДопустимаяСуммаЗадолженности;
	//	
	//	
	//	ЗадолженностьПоПартнеру= ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоПартнеру(ДатаОстатков, Объект.Основание.Партнер);
	//	Объект.ЗадолженностьПоПартнеру= ЗадолженностьПоПартнеру;
	//	
	//	Если Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности Тогда
	//		Если ЛистыСогласованияСервер.ЕстьНеЗакрытыеЛистыПоДоговору(Объект) Тогда 
	//			Объект.СуммаСогласования= Объект.СуммаДокумента;
	//		ИначеЕсли Объект.СогласованиеПросроченнойЗадолженности тогда
	//			Объект.СуммаСогласования= Объект.СуммаДокумента;
	//		Иначе
	//			Если ЗначениеЗаполнено(Объект.Договор) Тогда
	//				Объект.СуммаСогласования= ?(Объект.ЗадолженностьПоДоговору<0, 0, Объект.ЗадолженностьПоДоговору);
	//			Иначе
	//				Объект.СуммаСогласования= ?(Объект.ЗадолженностьПоПартнеру<0, 0, Объект.ЗадолженностьПоПартнеру);
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов Тогда
	//		ДатаОстатков= Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая);
	//		Если ПорядокРасчетов= Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда			
	//			струкЗадолженность= ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоТранзитам(ДатаОстатков, Объект.Основание.Договор);
	//			Задолженность= струкЗадолженность.СуммаОстаток;
	//			Объект.ЗадолженностьПоДоговору= Задолженность;
	//		Иначе
	//			струкЗадолженность= ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоТранзитам(ДатаОстатков, Объект.Основание);
	//			Задолженность= ?(струкЗадолженность.СуммаОстаток=0, струкЗадолженность.КОплатеОстаток, струкЗадолженность.СуммаОстаток);
	//			Объект.ЗадолженностьПоПартнеру= Задолженность;
	//		КонецЕсли;
	//		//Объект.ЗадолженностьПоПартнеру как правило отрецательная
	//		Если Задолженность >= 0 Тогда//Не было оплаты и есть задолженность
	//			Объект.СуммаСогласования= Объект.СуммаДокумента;
	//		ИначеЕсли Объект.СуммаДокумента+Задолженность < 0 Тогда//переплата
	//			Объект.СуммаСогласования= 0;
	//		Иначе//частичная или полная оплата
	//			Объект.СуммаСогласования= Объект.СуммаДокумента+Задолженность;
	//		КонецЕсли;
	//		//Объект.СуммаСогласования= ?(Объект.ЗадолженностьПоПартнеру<=0, , Объект.СуммаДокумента);
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура УстановитьЗаголовокСтраницы()
	НеИсп= Объект.Проблемы.НайтиСтроки(Новый Структура("Выполнено", Ложь));
	Элементы.СтраницаПроблемы.Заголовок= "Проблемы ("+НеИсп.Количество()+" из "+Объект.Проблемы.Количество()+")";
КонецПроцедуры

//расчет остатка лимита
&НаСервере
Процедура РасчетатьИзросходованныйЛимит()
	Если Объект.ВидОперации <> Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления Тогда
		Объект.ОстатокДоступногоЛимита= ЛистыСогласованияСервер.ПолучитьОстатокДоступногоЛимита(Объект)-Объект.СуммаСогласования+Объект.СуммаОплаты;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РасчетатьИтоговаяСуммаСогласования()
	Если Объект.ВидОперации <> Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления Тогда
		ИтоговаяСуммаСогласования= ЛистыСогласованияСервер.РасчетатьИтоговаяСуммаСогласования(Объект)+Объект.СуммаСогласования-Объект.СуммаОплаты;
	ИначеЕсли Объект.Проблема = Справочники.Проблемы.НайтиПоКоду("000000001") Тогда//Доставка по звонку
		ИтоговаяСуммаСогласования= Объект.СуммаДокумента - Объект.СуммаОплаты;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановкаВидимости()
	Элементы.ПричинаАнулирования.Видимость= Ложь;
	Элементы.ДокументыСданыКомментарий.Видимость= Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Элементы.ГруппаИсполнение.Видимость= Ложь;
		Элементы.ГруппаСогласованиеОбщая.Видимость= Ложь;
		Элементы.Аннулирован.Видимость= Ложь;
		Элементы.Проблема.Видимость= Ложь;
		Элементы.СтраницаПроблемы.Видимость= Ложь;
		Элементы.СуммаСогласования.Видимость= Ложь;
		Элементы.СуммаОплаты.Видимость= Ложь;
		Элементы.ЗадолженностьПоДоговору.Видимость= Ложь;
		Элементы.ЗадолженностьПоПартнеру.Видимость= Ложь;
		Элементы.ОплатаДо.Видимость= Ложь;
		Элементы.СогласованиеПросроченнойЗадолженности.Видимость= Ложь;
	Иначе
		Элементы.ГруппаИсполнение.Видимость= Истина;
		Элементы.ГруппаСогласованиеОбщая.Видимость= Истина;
		Элементы.Аннулирован.Видимость= Истина;
	КонецЕсли;
	
	Элементы.СчетФактураВыд.Видимость = Ложь;
	Элементы.СчетФактураВход.Видимость = Ложь;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеОформления") Тогда
		Элементы.Проблема.Видимость= Истина;
		Элементы.СтраницаПроблемы.Видимость= Истина;
		Элементы.ОплатаДо.Видимость= Ложь;
		Элементы.СуммаСогласования.Видимость= Ложь;
		Элементы.СуммаОплаты.Видимость= Истина;
		Элементы.ЗадолженностьПоДоговору.Видимость= Ложь;
		Элементы.ЗадолженностьПоПартнеру.Видимость= Ложь;
		Элементы.ОстатокДоступногоЛимита.Видимость= Ложь;
		Элементы.ПричинаАнулирования.Видимость= Объект.Аннулирован;
		Элементы.ДокументыСданыКомментарий.Видимость= Объект.ДокументыСданы;
		Элементы.СогласованиеПросроченнойЗадолженности.Видимость= Ложь;
		Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Элементы.СчетФактураВыд.Видимость = Истина;
		ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") ИЛИ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
			Элементы.СчетФактураВход.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности") ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеТранзитов") Тогда
		Элементы.Проблема.Видимость= Ложь;
		Элементы.СтраницаПроблемы.Видимость= Ложь;
		Элементы.ОплатаДо.Видимость= Истина;
		Элементы.СуммаСогласования.Видимость= Истина;
		Элементы.СуммаОплаты.Видимость= Истина;
		Элементы.ЗадолженностьПоДоговору.Видимость= Истина;
		Элементы.ЗадолженностьПоПартнеру.Видимость= Истина;
		Элементы.ОстатокДоступногоЛимита.Видимость= Истина;
		Элементы.СогласованиеПросроченнойЗадолженности.Видимость= Истина;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Проблема) Тогда 
		Элементы.ДатаДоставки.Видимость = Ложь;
		Элементы.ФормаОплаты.Видимость = Ложь; 
		Элементы.ЗаполнитьДатуИФормуОплаты.Видимость = Ложь; 
	КонецЕсли;
	Если ПроверитьПроблему()  Тогда 
		Элементы.ДатаДоставки.Видимость = Истина;
		Элементы.ФормаОплаты.Видимость = Истина; 
		Элементы.ЗаполнитьДатуИФормуОплаты.Видимость = Истина;
	Иначе
		Элементы.ДатаДоставки.Видимость = Ложь;
		Элементы.ФормаОплаты.Видимость = Ложь; 
		Элементы.ЗаполнитьДатуИФормуОплаты.Видимость = Ложь; 
	КонецЕсли;
	
КонецПроцедуры       

&НаСервере
Функция ПроверитьПроблему()  
	Если Объект.Проблема = Справочники.Проблемы.НайтиПоКоду("000000001") Тогда // Доставка по звонку
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура УстановкаДоступностиПоПравам()
	УстановитьТолькоПросмотр(Истина);
	ЭтаФорма.ТолькоПросмотр=Истина;
	
	//Открываем права по полям
	Если ИмеетПравоДобавленияИзмененияЛистовСогласования() И Не (Объект.Согласован ИЛИ Объект.Исполнен ИЛИ Объект.Аннулирован) Тогда
		УстановитьТолькоПросмотр(Ложь);
		ЭтаФорма.ТолькоПросмотр=Ложь;
		Элементы.Аннулирован.ТолькоПросмотр= Ложь;
	КонецЕсли;
	Если  Объект.Исполнен ИЛИ Объект.Аннулирован Тогда
		Элементы.Проблемы.ТолькоПросмотр= Истина;
	Иначе
		Элементы.Проблемы.ТолькоПросмотр= Ложь;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности") И ИмеетПравоАннулированияЛистовПоЗадолженности() Тогда		
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.Аннулирован.ТолькоПросмотр= Ложь;
	КонецЕсли;		
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеОформления") И ИмеетПравоАннулированияЛистовПоОформлению() Тогда		
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.Аннулирован.ТолькоПросмотр= Ложь;
	КонецЕсли;		
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеТранзитов") И ИмеетПравоАннулированияЛистовПоТранзитам() Тогда		
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.Аннулирован.ТолькоПросмотр= Ложь;
	КонецЕсли;		
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности") И ИмеетПравоИсполненияЛистовПоЗадолженности() Тогда
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.Исполнен.ТолькоПросмотр= Ложь;
		Элементы.ДокументыСданы.ТолькоПросмотр= Ложь;
		Если ИмеетПравоРедактироватьДатуИсполнения() Тогда
			Элементы.ДатаИсполнения.ТолькоПросмотр= Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеТранзитов") И ИмеетПравоИсполненияЛистовПоТранзитам() Тогда
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.Исполнен.ТолькоПросмотр= Ложь;
		Элементы.ДокументыСданы.ТолькоПросмотр= Ложь;
		Если ИмеетПравоРедактироватьДатуИсполнения() Тогда
			Элементы.ДатаИсполнения.ТолькоПросмотр= Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеОформления") И ИмеетПравоИсполненияЛистовПоОформлению() Тогда
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.Исполнен.ТолькоПросмотр= Ложь;
		Элементы.ДокументыСданы.ТолькоПросмотр= Ложь;
		Элементы.СтраницаПроблемы.ТолькоПросмотр= Ложь;
		Если ИмеетПравоРедактироватьДатуИсполнения() Тогда
			Элементы.ДатаИсполнения.ТолькоПросмотр= Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности") И ИмеетПравоСоглосованияЛистовПоЗадолженности() Тогда
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.Согласован.ТолькоПросмотр= Ложь;
	КонецЕсли;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеТранзитов") И ИмеетПравоСоглосованияЛистовПоТранзитам() Тогда
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.Согласован.ТолькоПросмотр= Ложь;
	КонецЕсли;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеОформления") И ИмеетПравоСоглосованияЛистовПоОформлению() Тогда
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.Согласован.ТолькоПросмотр= Ложь;
	КонецЕсли;
	
	Если ИмеетПравоСоглосованияЛистовЗаДругого() Тогда
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.Согласовано.ТолькоПросмотр= Ложь;
	КонецЕсли;
	
	Если ИмеетРольЛогистОператор() ИЛИ ИмеетРольУдалениеПеремещенийБухгалтерия() ИЛИ ИмеетПолныеПрава() Тогда
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.Статус.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	//Видимость конкретных полей	
	Если Объект.Согласован Тогда
		Элементы.Согласовано.ТолькоПросмотр= Истина;
	КонецЕсли;
	
	Если ИмеетПравоРедактироватьДату() Тогда
		Элементы.Дата.ТолькоПросмотр= Ложь;
		Элементы.Ответственный.ТолькоПросмотр= Ложь;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеОформления") И ИмеетПравоВноситьЧастичнуюОплатуПоЗадолженности() Тогда
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.СуммаОплаты.ТолькоПросмотр= Ложь;
	КонецЕсли;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности") И ИмеетПравоВноситьЧастичнуюОплатуПоЗадолженности() Тогда
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.СуммаОплаты.ТолькоПросмотр= Ложь;
	КонецЕсли;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеТранзитов") И ИмеетПравоВноситьЧастичнуюОплатуПоТранзитам() Тогда
		ЭтаФорма.ТолькоПросмотр= Ложь;
		Элементы.СуммаОплаты.ТолькоПросмотр= Ложь;
	КонецЕсли;
	ИмеетРольЛогистОператор();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТолькоПросмотр(Значение)
	Элементы.ФормаКоманднаяПанель.ТолькоПросмотр= Значение;
	Элементы.ВидОперации.ТолькоПросмотр= Значение;
	Элементы.ОплатаДо.ТолькоПросмотр= Значение;
	Элементы.Проблема.ТолькоПросмотр= Значение;
	Элементы.СтраницаПроблемы.ТолькоПросмотр= Значение;
	Элементы.ОсновнойМенеджер.ТолькоПросмотр= Значение;
	Элементы.Согласовано.ТолькоПросмотр= Значение;
	Элементы.Комментарий.ТолькоПросмотр= Значение;
	Элементы.ПроблемыПроблема.ТолькоПросмотр= Значение;
	Элементы.СогласованиеПросроченнойЗадолженности.ТолькоПросмотр= Значение;
		//тимашков 10042021
	если типзнч(Объект.Основание)=тип("документссылка.КорректировкаЗадолженности") тогда
		Элементы.ВидОперации.ТолькоПросмотр= истина;
	конецесли;
	//тимашков 10042021
	
	//Элементы.Согласован.ТолькоПросмотр= Значение;
	//Элементы.Исполнен.ТолькоПросмотр= Значение;
	//Элементы.Аннулирован.ТолькоПросмотр= Значение;
КонецПроцедуры

//Права
&НаСервере
Функция ИмеетПравоСоглосованияЛистовПоЗадолженности()
	Возврат ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовПоЗадолженности();
КонецФункции
&НаСервере
Функция ИмеетПравоСоглосованияЛистовПоТранзитам()
	Возврат ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовПоТранзитам();
КонецФункции
&НаСервере
Функция ИмеетПравоСоглосованияЛистовПоОформлению()
	Возврат ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовПоОформлению();
КонецФункции
&НаСервере
Функция ИмеетПравоИсполненияЛистовПоЗадолженности()
	Возврат ЛистыСогласованияСервер.ИмеетПравоИсполненияЛистовПоЗадолженности();
КонецФункции
&НаСервере
Функция ИмеетПравоИсполненияЛистовПоТранзитам()
	Возврат ЛистыСогласованияСервер.ИмеетПравоИсполненияЛистовПоТранзитам();
КонецФункции
&НаСервере
Функция ИмеетПравоИсполненияЛистовПоОформлению()
	Возврат ЛистыСогласованияСервер.ИмеетПравоИсполненияЛистовПоОформлению();
КонецФункции
&НаСервере
Функция ИмеетПолныеПрава()
	Возврат ЛистыСогласованияСервер.ИмеетПолныеПрава();
КонецФункции
&НаСервере
Функция ИмеетПравоСоглосованияЛистовЗаДругого()
	Возврат ЛистыСогласованияСервер.ИмеетПравоСоглосованияЛистовЗаДругого();
КонецФункции
&НаСервере
Функция ИмеетПравоДобавленияИзмененияЛистовСогласования()
	Возврат ЛистыСогласованияСервер.ИмеетПравоДобавленияИзмененияЛистовСогласования();
КонецФункции
&НаСервере
Функция ИмеетПравоАннулированияЛистовПоЗадолженности()
	Возврат ЛистыСогласованияСервер.ИмеетПравоАннулированияЛистовПоЗадолженности();
КонецФункции
&НаСервере
Функция ИмеетПравоАннулированияЛистовПоТранзитам()
	Возврат ЛистыСогласованияСервер.ИмеетПравоАннулированияЛистовПоТранзитам();
КонецФункции
&НаСервере
Функция ИмеетПравоАннулированияЛистовПоОформлению()
	Возврат ЛистыСогласованияСервер.ИмеетПравоАннулированияЛистовПоОформлению();
КонецФункции
&НаСервере
Функция ИмеетПравоРедактироватьДату()
	Возврат ЛистыСогласованияСервер.ИмеетПравоРедактироватьДату();
КонецФункции
&НаСервере
Функция ИмеетПравоВноситьЧастичнуюОплатуПоЗадолженности()
	Возврат ЛистыСогласованияСервер.ИмеетПравоВноситьЧастичнуюОплатуПоЗадолженности();
КонецФункции
&НаСервере
Функция ИмеетПравоВноситьЧастичнуюОплатуПоТранзитам() 
	Возврат ЛистыСогласованияСервер.ИмеетПравоВноситьЧастичнуюОплатуПоТранзитам();
КонецФункции
&НаСервере
Функция ИмеетПравоРедактироватьДатуИсполнения()
	Возврат ЛистыСогласованияСервер.ИмеетПравоРедактироватьДатуИсполнения();
КонецФункции
&НаСервере
Функция ИмеетРольЛогистОператор()
	Возврат РольДоступна("ЛогистОператор");
КонецФункции
&НаСервере
Функция ИмеетРольУдалениеПеремещенийБухгалтерия()
	Возврат РольДоступна("УдалениеПеремещенийБухгалтерия");
КонецФункции

&НаСервере
функция ТекущийПользователь()
	Возврат Пользователи.ТекущийПользователь();
КонецФункции

&НаСервере
функция ЕстьДругиеЛистыПоЗадолженности()
	Возврат ЛистыСогласованияСервер.ЕстьДругиеЛистыПоЗадолженности(Объект);
КонецФункции


//События формы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РасчетатьИтоговаяСуммаСогласования();
	
	УстановитьЗаголовокСтраницы();
	СтатусЭДО=ВернутьРеквизитЭДО(Объект.Основание);
	
	Если Объект.СтатусЛистаСогласования = Перечисления.СтатусыЛистовСогласования.ПустаяСсылка() Тогда
		Объект.СтатусЛистаСогласования = Перечисления.СтатусыЛистовСогласования.ВРаботе;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды      
	
КонецПроцедуры          

&НаСервере
Функция ВернутьРеквизитЭДО(Основание)
	если значениезаполнено(Основание) и
		ОбщегоНазначения.ЕстьРеквизитОбъекта("СтатусДокументаВЭДО",Основание.Метаданные()) тогда	
		Возврат Основание.СтатусДокументаВЭДО;
	иначе        
		возврат Перечисления.СтатусыДокументаЭДО.ПустаяСсылка();
	конецесли; 

КонецФункции // ВернутьРеквизитЭДО()


// Если ТолькоПроверка = Истина - будет подготовлено сообщение о различиях ДатыДоставки и ФормыОплаты. 
// Если ТолькоПроверка = Ложь - будут заполнены поля текущего документа ДатыДоставки и ФормыОплаты 
&НаСервере
Функция ПроверитьФормуОплатыДатуДоставкиНаСервере(ТолькоПроверка = Ложь)
Если ЗначениеЗаполнено(Объект.Основание) И Объект.Проблема = Справочники.Проблемы.НайтиПоКоду("000000001") Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказНаДоставкуКлиентуОснования.Ссылка.ПрибытиеНаОтгрузку КАК ДатаДоставки,
			|	ЗаказНаДоставкуКлиентуОснования.Ссылка.ОплатаБанковскойКартой КАК ОплатаБанковскойКартой,
			|	ЗаказНаДоставкуКлиентуОснования.Ссылка.НужнаИнкассация КАК НужнаИнкассация,
			|	ЗаказНаДоставкуКлиентуОснования.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаказНаДоставкуКлиенту.Основания КАК ЗаказНаДоставкуКлиентуОснования
			|ГДЕ
			|	ЗаказНаДоставкуКлиентуОснования.Документ = &Ссылка
			|	И ЗаказНаДоставкуКлиентуОснования.Ссылка.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Основание);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда     
			Если ТолькоПроверка Тогда  
				Если Не Объект.Аннулирован Тогда
					ОшибкаПоДокументу = "";
					Если Объект.ДатаДоставки <> Выборка.ДатаДоставки Тогда    
						Если ЗначениеЗаполнено(Выборка.ДатаДоставки) Тогда
							ОшибкаПоДокументу = СтрШаблон("%1%2. ","Разные даты доставки - ",Выборка.ДатаДоставки);
						Иначе                            
							ОшибкаПоДокументу = СтрШаблон("%1%2. ","Разные даты доставки - ","Не заполнено");
						КонецЕсли;	
					КонецЕсли;	             
					
					Если Выборка.ОплатаБанковскойКартой Тогда   
						ФормаОплатыПоДокументу = Перечисления.ФормыОплаты.ПлатежнаяКарта;
					ИначеЕсли Выборка.НужнаИнкассация Тогда  
						ФормаОплатыПоДокументу = Перечисления.ФормыОплаты.Наличная;  
					Иначе
						ФормаОплатыПоДокументу = Неопределено;
					КонецЕсли;	
					
					
					Если ФормаОплатыПоДокументу <> Объект.ФормаОплаты Тогда   
						Если ЗначениеЗаполнено(ФормаОплатыПоДокументу) Тогда
							ОшибкаПоДокументу = СтрШаблон("%1%2%3. ",ОшибкаПоДокументу,"Разные формы оплаты - ",ФормаОплатыПоДокументу); 
						Иначе               
							ОшибкаПоДокументу = СтрШаблон("%1%2%3. ",ОшибкаПоДокументу,"Разные формы оплаты - ","Не заполнено");
						КонецЕсли;	
					КонецЕсли;
					Если ОшибкаПоДокументу <> "" Тогда    
						ТекущееСообщение = Новый СообщениеПользователю;
						ТекущееСообщение.Текст = СтрШаблон("%1 %2",ОшибкаПоДокументу,Выборка.Ссылка);
						ТекущееСообщение.КлючДанных = Выборка.Ссылка;
						ТекущееСообщение.Сообщить(); 
						Возврат Истина;
					Иначе
						Возврат Ложь;	
					КонецЕсли;	
				КонецЕсли;
			Иначе	
				Объект.ДатаДоставки = Выборка.ДатаДоставки;         	
				Если Выборка.ОплатаБанковскойКартой Тогда   
					Объект.ФормаОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта;
				ИначеЕсли Выборка.НужнаИнкассация Тогда  
					Объект.ФормаОплаты = Перечисления.ФормыОплаты.Наличная;  
				Иначе
					Объект.ФормаОплаты = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
КонецЕсли;	
КонецФункции	  

// СтандартныеПодсистемы.ПодключаемыеКоманды Не работает
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.Проблема = ПредопределенноеЗначение("Справочник.Проблемы.ПустаяСсылка");
	
	ВидОперацииПриИзмененииСервер();
	
	Объект.Согласован = Ложь;
	Объект.Исполнен = Ложь;
	Объект.Аннулирован = Ложь;
	
	ОбновитьЗадолженностьСервер();
	РасчетатьИтоговаяСуммаСогласования();
	УстановкаВидимости();
	УстановкаДоступностиПоПравам();
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеПросроченнойЗадолженностиПриИзменении(Элемент)
	ВидОперацииПриИзменении(Элемент);
КонецПроцедуры

&НаСервере
Процедура ВидОперацииПриИзмененииСервер()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов 
		ИЛИ (Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления И Объект.Ссылка = Документы.ЛистСогласования.ПустаяСсылка()) Тогда		
		Объект.Дата = ТекущаяДата();
	Иначе
		Объект.Дата = Объект.ДатаДокумента;
	КонецЕсли;

	Основание = Объект.Основание;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления
		И ТипЗнч(Основание) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Объект.ОсновнойМенеджер = Объект.Договор.Менеджер;
	Иначе
		Если Не ЗначениеЗаполнено(Основание.Контрагент.Партнер.ОсновнойМенеджер) Тогда
			Объект.ОсновнойМенеджер = Объект.АвторДокумента;
		Иначе
			Объект.ОсновнойМенеджер = Основание.Контрагент.Партнер.ОсновнойМенеджер;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановкаДоступностиПоПравам();
	УстановкаВидимости();   
	ПроверитьФормуОплатыДатуДоставкиНаСервере(Истина);
	Если СтатусПереданВБухгалтерию() Тогда
		Элементы.ДатаПередачиВБухгалтерию.Видимость = Истина;
	КонецЕсли; 
	
	ПроверитьОтправленоМенеджеру();
	
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьОтправленоМенеджеру()

Если Объект.Согласован Тогда
	УстановитьПривилегированныйРежим(Истина);
	Объект.ОтправленоМенеджеру = Истина;
	УстановитьПривилегированныйРежим(Ложь);
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИсполненПриИзменении(Элемент)
	Если Объект.Исполнен Тогда
		Если  Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеОформления") Тогда
			НеИсп= Объект.Проблемы.НайтиСтроки(Новый Структура("Выполнено", Ложь));
			Если НеИсп.Количество() > 0 Тогда 
				Объект.Исполнен= Ложь;
				Сообщить("Есть не закрытые проблемы!");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ТекДата = ТекущаяДата();
		Если День(ТекДата) <= 8 И НЕ ПроверитьПроблему() Тогда
			Объект.ДатаИсполнения = НачалоМесяца(ТекДата)-1;
		Иначе 
			Объект.ДатаИсполнения = ТекДата;
		КонецЕсли;
		
		Объект.Исполнитель= ТекущийПользователь();
		Объект.ДатаРегистрацииИсполнения= ТекущаяДата();
	Иначе
		Объект.ДатаИсполнения= Неопределено;
		Объект.Исполнитель= Неопределено;
		Объект.ДатаРегистрацииИсполнения= Неопределено;
	КонецЕсли;
	
	УстановкаДоступностиПоПравам();
КонецПроцедуры

&НаКлиенте
Процедура СогласованПриИзменении(Элемент)
	Если Объект.Согласован Тогда
		РасчетатьИзросходованныйЛимит();
		Если Объект.ОстатокДоступногоЛимита < 0 Тогда
			Объект.Согласован= Ложь;
			Сообщить("Привышен лимит согласования!", СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Согласован Тогда
		Объект.Согласователь= ТекущийПользователь();
		Объект.ДатаРегистрацииСогласования= ТекущаяДата();
		Элементы.Согласовано.ТолькоПросмотр= Истина;
	Иначе
		Объект.Согласователь= Неопределено;
		Объект.ДатаРегистрацииСогласования= Неопределено;
		Элементы.Согласовано.ТолькоПросмотр= Ложь;
	КонецЕсли;
	
	УстановкаДоступностиПоПравам();
	Если Объект.Согласован Тогда
		Объект.ОтправленоСогласователю = Истина;
	Иначе
		Объект.ОтправленоСогласователю = Ложь;
	КонецЕсли;	
		
КонецПроцедуры



&НаКлиенте
Процедура СогласованоПриИзменении(Элемент)
	РасчетатьИзросходованныйЛимит();
	СтароеСогласовано = ПолучитьСогласовано();
	Если СтароеСогласовано <> Объект.Согласовано и Объект.Согласовано <> Неопределено Тогда
		Объект.ОтправленоСогласователю = Ложь;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПолучитьСогласовано()
	Возврат Объект.Ссылка.Согласовано;
КонецФункции
                                                                                                  
&НаКлиенте
Процедура АннулированПриИзменении(Элемент)
	Если Объект.Аннулирован Тогда
		Объект.ПользовательАннулировал= ТекущийПользователь();
		
		ТекДата= ТекущаяДата();
		Если День(ТекДата) <= 8 Тогда
			Объект.ДатаРегистрацииАннулирования = НачалоМесяца(ТекДата)-1;
		Иначе
			Объект.ДатаРегистрацииАннулирования = ТекДата;
		КонецЕсли;
		
		
		Объект.Согласован= Ложь;
		Объект.Исполнен= Ложь;
		Элементы.Согласован.ТолькоПросмотр= Истина;
		Элементы.Исполнен.ТолькоПросмотр= Истина;
	Иначе
		Объект.ПользовательАннулировал= Неопределено;
		Объект.ДатаРегистрацииАннулирования= Неопределено;
	КонецЕсли;
	
	УстановкаВидимости();
	//УстановкаДоступностиПоПравам();
КонецПроцедуры

&НаКлиенте
Процедура СогласованоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
Объект.Согласовано= ВыбранноеЗначение;	

КонецПроцедуры


&НаКлиенте
Процедура ПроблемыПриИзменении(Элемент)
	УстановитьЗаголовокСтраницы();
КонецПроцедуры

&НаКлиенте
Процедура ПроблемыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если  Объект.Согласован Тогда
		Отказ= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроблемыПередУдалением(Элемент, Отказ)
		Если  Объект.Согласован Тогда
		Отказ= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаОплатыПриИзменении(Элемент)
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности")Тогда 
		//ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеТранзитов") Тогда
		Если Объект.СуммаОплаты > Объект.СуммаСогласования Тогда
			Объект.СуммаОплаты = 0;
			Сообщить("Сумма согласования <= Сумма оплаты");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	РасчетатьИтоговаяСуммаСогласования();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыСданыПриИзменении(Элемент)
	УстановкаВидимости();
КонецПроцедуры


&НаКлиенте
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		//тимашков 10042021
	Если ТипЗнч(Объект.Основание)=Тип("ДокументСсылка.КорректировкаЗадолженности") тогда
		СтандартнаяОбработка=Ложь;	
		Возврат;
	КонецЕсли;  
	//тимашков 10042021

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуИФормуОплаты(Команда)
	ПроверитьФормуОплатыДатуДоставкиНаСервере();
КонецПроцедуры

//&НаКлиенте
//Процедура ПослеЗаписи(ПараметрыЗаписи)
//
//	ПроверитьФормуОплатыДатуДоставкиНаСервере(Истина);
//	
//	Если НЕ Объект.ОтправленоСогласователю И АльтерраОбщегоНазначения.ЭтоРабочаяБаза() Тогда
//		
//		 Сотрудник = ПолучитьПользователя();
//		 НавСсылка = ПолучитьНавигационнуюСсылку(Объект.Ссылка);
//		 
//		 ТелоСообщения = "Требуется согласовать "+ Объект.Ссылка + " !" + Символы.ПС + НавСсылка;
//		 
//		 Результат = АльтерраВзаимодействиеСБитрикс24.ОтправитьСообщениеВБитрикс(ТелоСообщения, Сотрудник);		
//		 
//		 Если Результат <> Неопределено Тогда 
//			 Объект.ОтправленоСогласователю = Истина;
//		 Иначе
//			 Сообщить("Не получилось отправить данные в Битрикс!");
//		 КонецЕсли; 
//		 
//	КонецЕсли;	
//	
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьПользователя()
//	Возврат Объект.Ссылка.Согласовано.Пользователь;
//КонецФункции

&НаКлиенте
Процедура ПроблемаПриИзменении(Элемент)
		УстановкаВидимости();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗадолженность(Команда)
 ОбновитьЗадолженностьСервер();
 РасчетатьИзросходованныйЛимит();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	Если СтатусПереданВБухгалтерию() Тогда
		Объект.ДатаПередачиВБухгалтерию = ТекущаяДата();
		Элементы.ДатаПередачиВБухгалтерию.Видимость = Истина;
	Иначе
		Объект.ДатаПередачиВБухгалтерию = Дата("0001.01.01 00:00:00");
		Элементы.ДатаПередачиВБухгалтерию.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция СтатусПереданВБухгалтерию()

	Возврат Объект.СтатусЛистаСогласования = Перечисления.СтатусыЛистовСогласования.ПереданВБухгалтерию;

КонецФункции 


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи) 
		 
      УведомлениеПоСогласованиюОформления();

КонецПроцедуры  



&НаКлиенте
Процедура УведомлениеПоСогласованиюОформления()
	
	Если Объект.Согласован И НЕ Объект.ОтправленоМенеджеру Тогда
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеОформления") Тогда
			
			ТекстСообщения = "Оформлен Лист согласования " + Объект.НомерДокумента + " от " + Объект.Дата + " по контрагенту " + Объект.Контрагент + " ,Документ№" + Объект.СчетФактура + ", причина - " + Объект.Комментарий;
			
			Результат = АльтерраВзаимодействиеСБитрикс24.ВыполнитьЗапросУниверсальный("5508", "im.message.add", Объект.ОсновнойМенеджер, ТекстСообщения);
			
			Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
				Сообщить("Не получилось отправить данные в задачу Битрикс! " + Результат.ОписаниеОшибки);
			Иначе
				Объект.ОтправленоМенеджеру = Истина;
			КонецЕсли; 
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры
